import React from "react";
import "../styles/App.css";
import { Link } from 'react-router-dom';


const Terms = () => {
  return (
    <div className="terms-page">
      <div className="terms-container">
        <div className="terms-header">
          <h1>قوانین و مقررات</h1>
          <p>شرایط استفاده از تست شخصیت سیاسی</p>
        </div>

        <div className="terms-content">
          <div className="term-item">
            <h3>۱. هدف تست</h3>
            <p>
              استفاده از این تست به معنی پذیرش شرایطی است که در ادامه به صورت
              شفاف توضیح داده شده است. این تست برای سرگرمی، آشنایی کلی و ایجاد
              یک تجربه ساده طراحی شده است و هدف آن ارائه تحلیل قطعی یا علمی
              درباره گرایش‌های سیاسی شما نیست. پاسخ‌هایی که وارد می‌کنید تنها یک
              برداشت کلی ایجاد می‌کنند و ممکن است نتیجه نهایی با نظر، باور یا
              تصور شما هماهنگ نباشد. تفاوت برداشت کاملا طبیعی است و دلیل آن این
              است که این تست جایگزین تحلیل تخصصی یا مراجعه به منابع معتبر نیست.
            </p>
          </div>

          <div className="term-item">
            <h3>۲. حریم خصوصی</h3>
            <p>
              اطلاعاتی که در طول تست وارد می‌کنید در هیچ سروری ذخیره نمی‌شود و
              خارج از دستگاه شما قرار نمی‌گیرد. تمام داده‌ها فقط روی مرورگر
              خودتان و در فضای لوکال استوریج نگه‌داری می‌شود تا بتوانید روند تست
              را ادامه دهید یا نتیجه را دوباره مشاهده کنید. این اطلاعات
              قابل‌انتقال، قابل‌اشتراک‌گذاری یا قابل‌ردیابی نیست و هیچ فرد یا
              نهادی به آن دسترسی ندارد. در هر زمان که بخواهید می‌توانید داده‌ها
              را از بخش تنظیمات مرورگر حذف کنید و همه اطلاعات کاملا از بین
              می‌روند. ما هیچ نوع اطلاعات شخصی مانند نام، شماره تماس، ایمیل،
              موقعیت مکانی یا سابقه فعالیت شما را جمع‌آوری نمی‌کنیم و به هیچ شکل
              از داده‌های شما برای هدف تبلیغاتی یا تحلیلی استفاده نمی‌شود. نتیجه
              تست صرفا برای نمایش روی دستگاه شماست و پس از بسته شدن صفحه نیز
              خارج از مرورگر شما ذخیره نخواهد شد.
            </p>
          </div>

          <div className="term-item">
            <h3>۳. مسئولیت</h3>
            <p>
             مسئولیت تفسیر نتیجه تست بر عهده خود شماست. این تست برای تصمیم‌گیری‌های مهم یا استفاده رسمی مناسب نیست و توصیه می‌شود نتیجه آن را تنها به عنوان یک دید کلی و تجربه تفریحی در نظر بگیرید. هرگونه استفاده نادرست یا برداشت اشتباه بر عهده خود کاربر است.
            </p>
          </div>

          <div className="term-item">
            <h3>۴. تغییرات</h3>
            <p>
                در صورت اعمال تغییر در قوانین، نسخه جدید همین‌جا منتشر می‌شود و ادامه استفاده از تست به منزله پذیرش شرایط تازه خواهد بود. هدف ما ارائه فضایی ساده، امن، شفاف و بدون نگرانی برای شماست تا تجربه‌ای راحت و بدون ریسک داشته باشید.
            </p>
          </div>
        </div>

        <div className="terms-footer">
            <Link to="/">
          <button className="agree-btn">
            موافقم
          </button>
          </Link>
        </div>
      </div>
    </div>
  );
};

export default Terms;
